## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:41" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:41" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 41 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6b37f8b0bc9fdf8b1860a5ea667850b5-5" -> "03f26d9515a21efcc51fb0dc9cc27268"
      ~ id                     = "cpfValidation.33197d2b5c1fd56ba250eb5e465a0c4b.zip" -> (known after apply)
      ~ key                    = "cpfValidation.33197d2b5c1fd56ba250eb5e465a0c4b.zip" -> "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "33197d2b5c1fd56ba250eb5e465a0c4b" -> "03f26d9515a21efcc51fb0dc9cc27268"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "6cybaX_RqIXtNH1mxjVJs.svXrp9Mmpe" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-excelToJson" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "609a397e9343c863307b70227cbb2c9a-6" -> "f12d747e0b78b872f335428cbff9a31b"
      ~ id                     = "excelToJson.a353743c6db71a81967ec6cbdfe9b209.zip" -> (known after apply)
      ~ key                    = "excelToJson.a353743c6db71a81967ec6cbdfe9b209.zip" -> "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "a353743c6db71a81967ec6cbdfe9b209" -> "f12d747e0b78b872f335428cbff9a31b"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "hbC31tbY2HcrFC48Eqyh0hh68Ynxo2zH" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "14fde8b6214cc06eac76e96704c38260-6" -> "87a1740978da9ac280c9fde1ae6d8580"
      ~ id                     = "graphql.a69909464baa18857436b267071324da.zip" -> (known after apply)
      ~ key                    = "graphql.a69909464baa18857436b267071324da.zip" -> "graphql.87a1740978da9ac280c9fde1ae6d8580.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "a69909464baa18857436b267071324da" -> "87a1740978da9ac280c9fde1ae6d8580"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "i2psOpkJisKd63svb2SVbtDpWEKhfMcU" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a585eabe5ebde7a1b29219b1afcca48a" -> "a026d5003306eda761f9dffea99711ea"
        id                     = "dist/200.html"
      ~ source_hash            = "a585eabe5ebde7a1b29219b1afcca48a" -> "a026d5003306eda761f9dffea99711ea"
        tags                   = {}
      ~ version_id             = "ClSjdboc7VB6EFCgx.OiT0KsBFvEO.AG" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "cded52c7515e8db4bd3d4fc8e119388d" -> "f19e19b6440a39a92a56ada5ac73f8a1"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "cded52c7515e8db4bd3d4fc8e119388d" -> "f19e19b6440a39a92a56ada5ac73f8a1"
        tags                   = {}
      ~ version_id             = "5aSu8nSNhC9ID6jmWPqYjb2DTBRSvzy9" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "420057cbeaf0ea47e2ee65bda75ca4f6" -> "e945421ff963baaa6dd9b01320ba65f8"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "420057cbeaf0ea47e2ee65bda75ca4f6" -> "e945421ff963baaa6dd9b01320ba65f8"
        tags                   = {}
      ~ version_id             = "sqRPeijJ0qJp5pkKoHgPnmhlSKmSdEDe" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a585eabe5ebde7a1b29219b1afcca48a" -> "a026d5003306eda761f9dffea99711ea"
        id                     = "dist/index.html"
      ~ source_hash            = "a585eabe5ebde7a1b29219b1afcca48a" -> "a026d5003306eda761f9dffea99711ea"
        tags                   = {}
      ~ version_id             = "DpY77GthrmzLz3uDw4IEyuFcd6Tw5zP6" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.47627b0f.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "9387779d63c84b54aa3530d32023af39"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.47627b0f.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.47627b0f.chunk.js"
+       source_hash            = "9387779d63c84b54aa3530d32023af39"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.47627b0f.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "27a5f7584a3a992250b7df0de6d4c1a1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.47627b0f.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.47627b0f.chunk.js.LICENSE.txt"
+       source_hash            = "27a5f7584a3a992250b7df0de6d4c1a1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.71cc5713.chunk.js"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.71cc5713.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "6b925e068cdbfdc4c263039cec3be0ec" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.71cc5713.chunk.js" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.71cc5713.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.71cc5713.chunk.js" -> null
-       source_hash            = "6b925e068cdbfdc4c263039cec3be0ec" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "qADvbtm.2PlHkKGBjrak11uF7zSlOle." -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.71cc5713.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.71cc5713.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "27a5f7584a3a992250b7df0de6d4c1a1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.71cc5713.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.71cc5713.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.71cc5713.chunk.js.LICENSE.txt" -> null
-       source_hash            = "27a5f7584a3a992250b7df0de6d4c1a1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ry0bfJZmPdrHFecAmLYB.hjnvr8GC_Uy" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c1bfb54d.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "77ffd8be9dd1b2f5f8dddae0a301303a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js"
+       source_hash            = "77ffd8be9dd1b2f5f8dddae0a301303a"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c1bfb54d.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "cc27fa172211f2877b50629ac7228a71"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js.LICENSE.txt"
+       source_hash            = "cc27fa172211f2877b50629ac7228a71"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.e7e2bf2b.chunk.js"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.e7e2bf2b.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "3fbd1b26308a5e87afbc233a9ad02e86" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.e7e2bf2b.chunk.js" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.e7e2bf2b.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.e7e2bf2b.chunk.js" -> null
-       source_hash            = "3fbd1b26308a5e87afbc233a9ad02e86" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "eVOxN6bCbCPs1my1PZ2LTorDyB5LaRB3" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.e7e2bf2b.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.e7e2bf2b.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "cc27fa172211f2877b50629ac7228a71" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.e7e2bf2b.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.e7e2bf2b.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.e7e2bf2b.chunk.js.LICENSE.txt" -> null
-       source_hash            = "cc27fa172211f2877b50629ac7228a71" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "YBYJtB_Xk97H_tWisF3xTtEgdCtJMwFQ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.8d63b626.js"] will be destroyed
  # (because key ["static/js/app.8d63b626.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5079544aa8a63f6049b703bba5c40ac1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.8d63b626.js" -> null
-       key                    = "dist/static/js/app.8d63b626.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.8d63b626.js" -> null
-       source_hash            = "5079544aa8a63f6049b703bba5c40ac1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "dmiyJAuZEWhEiYM7QLG9cFH5NzSB9RU5" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.8d63b626.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.8d63b626.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "8d38c03ef794fa32760c896577fdf875" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.8d63b626.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.8d63b626.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.8d63b626.js.LICENSE.txt" -> null
-       source_hash            = "8d38c03ef794fa32760c896577fdf875" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "JBB1X.WIjtZbXfRwBEe9o7ejcEJa4hrc" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a4a59ef2.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "477001a4168880f36a33d621b9e8d254"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a4a59ef2.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a4a59ef2.js"
+       source_hash            = "477001a4168880f36a33d621b9e8d254"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a4a59ef2.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8d38c03ef794fa32760c896577fdf875"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a4a59ef2.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a4a59ef2.js.LICENSE.txt"
+       source_hash            = "8d38c03ef794fa32760c896577fdf875"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.2345ee21.js"] will be destroyed
  # (because key ["static/js/runtime-app.2345ee21.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "4f6a9f5d4b0fed3671985f70aad10f05" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.2345ee21.js" -> null
-       key                    = "dist/static/js/runtime-app.2345ee21.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.2345ee21.js" -> null
-       source_hash            = "4f6a9f5d4b0fed3671985f70aad10f05" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "OKMnZm54gV77LAY4tAq6TTnZEPT79u2s" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.7c9ddb56.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "a8e3f4c03318954fce33f38a33d2726a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.7c9ddb56.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.7c9ddb56.js"
+       source_hash            = "a8e3f4c03318954fce33f38a33d2726a"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-01-23T02:44:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:10/invocations" -> (known after apply)
      ~ s3_key                         = "cpfValidation.33197d2b5c1fd56ba250eb5e465a0c4b.zip" -> "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip"
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "08ce71c38ed47601f4b08f3d364bb0665ac975c1" -> "c0257177d73ab61d8ccac7c090ee4c5526dd2352"
              ~ "DD_TAGS"                      = "git.commit.sha:08ce71c38ed47601f4b08f3d364bb0665ac975c1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:c0257177d73ab61d8ccac7c090ee4c5526dd2352,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "08ce71c38ed47601f4b08f3d364bb0665ac975c1" -> "c0257177d73ab61d8ccac7c090ee4c5526dd2352"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "10" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ last_modified                  = "2024-01-23T02:44:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:10/invocations" -> (known after apply)
      ~ s3_key                         = "excelToJson.a353743c6db71a81967ec6cbdfe9b209.zip" -> "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip"
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "08ce71c38ed47601f4b08f3d364bb0665ac975c1" -> "c0257177d73ab61d8ccac7c090ee4c5526dd2352"
              ~ "DD_TAGS"                      = "git.commit.sha:08ce71c38ed47601f4b08f3d364bb0665ac975c1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:c0257177d73ab61d8ccac7c090ee4c5526dd2352,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "08ce71c38ed47601f4b08f3d364bb0665ac975c1" -> "c0257177d73ab61d8ccac7c090ee4c5526dd2352"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "10" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-01-23T02:44:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:57" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:57/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.a69909464baa18857436b267071324da.zip" -> "graphql.87a1740978da9ac280c9fde1ae6d8580.zip"
        tags                           = {}
      ~ version                        = "57" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "08ce71c38ed47601f4b08f3d364bb0665ac975c1" -> "c0257177d73ab61d8ccac7c090ee4c5526dd2352"
              ~ "DD_TAGS"                            = "git.commit.sha:08ce71c38ed47601f4b08f3d364bb0665ac975c1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:c0257177d73ab61d8ccac7c090ee4c5526dd2352,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "08ce71c38ed47601f4b08f3d364bb0665ac975c1" -> "c0257177d73ab61d8ccac7c090ee4c5526dd2352"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "57" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 14 to add, 8 to change, 14 to destroy.
```

</details>

*Pusher: @dysmento, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7670117271)*